{
  "backend/main.mo": "Defines the backend actor with all core data types for users, drivers, trips, payments, and video metadata, and initializes access control and approval state with mixins.",
  "backend/migration.mo": "Contains type definitions for old and new data models and supports migrating stored trip records by adding the new declineReason field.",
  "feature_evidence.json": "Feature evidence report linking a frontend driver decline action update to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose and behavior of each frontend file in the project.",
  "frontend/index.css": "Defines global Tailwind-based OKLCH color variables, themes, and base styles for light and dark mode.",
  "frontend/index.html": "HTML entry point configuring meta tags, icons, and bootstrapping the React application.",
  "frontend/ops/publish-draft-v29-to-production.md": "Production release checklist for Draft Version 29 covering build verification, authentication, role flows, dashboards, and Stripe configuration.",
  "frontend/src/App.tsx": "Main app routing and state logic handling authentication, profile checks, role selection, and dashboard rendering.",
  "frontend/src/components/ApprovalPendingScreen.tsx": "Displays an approval-waiting screen with instructions, requirements, and messages based on user type.",
  "frontend/src/components/BookingRequestForm.tsx": "Form for users to request bookings with geolocation capture, driver selection, pricing logic, and checkout creation.",
  "frontend/src/components/Footer.tsx": "Footer with a scroll-to-video button and a copyright note.",
  "frontend/src/components/Header.tsx": "Header with authentication controls, theme switching, language selection, and user role display.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to set up profiles, capture location, upload photos, and submit driver or customer info for approval.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal for choosing a user role (customer or driver) and notifying the parent when selected.",
  "frontend/src/components/ServiceSelectionForm.tsx": "Form for selecting a service type, driver, trip details, and creating a trip with pricing and distance validation.",
  "frontend/src/components/StripeSetupCheck.tsx": "Admin-only dialog prompting initial Stripe configuration with secret key and allowed countries.",
  "frontend/src/components/TripDetailsDialog.tsx": "Dialog showing full trip details with driver actions, status updates, pricing, and administrative inputs.",
  "frontend/src/components/VideoPlayer.tsx": "Custom video player with play, mute, fullscreen controls and optional autoplay-muted behavior.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the authenticated/anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user, driver, trip, and earnings data via the backend actor.",
  "frontend/src/i18n/i18n.ts": "Handles language detection, local storage of language preference, and key‑based translation with fallbacks.",
  "frontend/src/i18n/I18nProvider.tsx": "Creates an i18n context provider that stores language preference and exposes a translate function.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and structured translation strings for the UI.",
  "frontend/src/i18n/useI18n.ts": "Exports a hook that returns the i18n context.",
  "frontend/src/index.css": "Configures Tailwind and defines light and dark theme variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements an admin dashboard showing approvals, stats, and access to the company wallet with translation support.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard showing active/completed trips, booking CTA, service form, and trip details dialog.",
  "frontend/src/pages/CompanyWallet.tsx": "Displays company earnings, commissions, deposits, and completed trip metrics using Stripe-backed data.",
  "frontend/src/pages/DriverDashboard.tsx": "Driver dashboard presenting trip stats, earnings summary, pending jobs, and access to detailed wallet and trip views.",
  "frontend/src/pages/DriverWallet.tsx": "Shows detailed driver earnings, deductions, and trip payment statuses with breakdowns by category.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, login buttons, instructional video, and feature highlights.",
  "frontend/src/utils/distance.ts": "Provides Haversine-based distance calculation and formatting utilities.",
  "frontend/src/utils/tripPricing.ts": "Handles manual mileage-based trip pricing, deposit/service fee rules, and distance validation.",
  "frontend/src/utils/tripProgress.ts": "Implements logic to map trip status and status updates to a UI-friendly progress state including step, labels, messages, and next driver actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, spacing, animations, and plugins including typography, container queries, and custom OKLCH-based design tokens.",
  "project_state.json": "Describes the project's current state, architecture, features, and known issues for the Cityprop ICP full‑stack dApp."
}