{
  "backend/main.mo": "Defines core types for users, drivers, trips, payments, earnings, and authorization state initialization for the backend actor.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests supporting publishing Draft Version 29 to production.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose and behavior of all major frontend components and pages.",
  "frontend/index.css": "Tailwind base and theme variable definitions implementing light/dark OKLCH color system and global styling.",
  "frontend/index.html": "HTML entry point configuring favicon, touch icon, metadata, and mounting the React application.",
  "frontend/ops/publish-draft-v29-to-production.md": "Production publish checklist outlining verification steps for deploying Draft Version 29.",
  "frontend/src/App.tsx": "Main app component handling authentication, role selection, profile setup, approval gating, and routing to dashboards.",
  "frontend/src/components/ApprovalPendingScreen.tsx": "Displays an approval-pending UI with instructions and requirements, showing different messaging for drivers versus regular users. Includes email instructions, driver requirements, and next steps using i18n translations.",
  "frontend/src/components/BookingRequestForm.tsx": "Form for creating a booking request, including trip details, geolocation capture, driver selection, pricing validation, and checkout session creation. Loads drivers, handles photos, and computes trip distance and pricing.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a button to scroll to a demo video and a copyright line linking to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the main navigation header with authentication controls, language selector, theme toggle, and user role badge. Integrates Internet Identity login and loads the caller's profile.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or updating user or driver profiles, capturing personal info, geolocation, vehicle details, and uploading photos. Supports driver-specific requirements and submits data for approval.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal for choosing between customer and driver roles, presenting each option with descriptions and selecting one to continue setup.",
  "frontend/src/components/ServiceSelectionForm.tsx": "Large booking form managing service selection, trip details, driver selection, pricing, and checkout session creation.",
  "frontend/src/components/StripeSetupCheck.tsx": "Admin-only dialog prompting initial Stripe configuration and submitting secret key and allowed countries.",
  "frontend/src/components/TripDetailsDialog.tsx": "Dialog showing trip details, progress, pricing, and allows drivers to update status, miles, and loading assistance.",
  "frontend/src/components/VideoPlayer.tsx": "Custom video player component with play, mute, fullscreen controls, overlays, and optional autoplay behavior.",
  "frontend/src/hooks/useActor.ts": "React hook creating and caching an authenticated or anonymous backend actor and invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, driver, trip, and related data using the actor API.",
  "frontend/src/i18n/i18n.ts": "Handles language detection, storage, and translation lookup with interpolation and fallbacks.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context provider managing current language, persistence, and translation access.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and structured translation strings for the UI.",
  "frontend/src/i18n/useI18n.ts": "Exports a simple hook that returns the i18n context.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard showing approvals, company earnings, and access to the company wallet.",
  "frontend/src/pages/ClientDashboard.tsx": "Displays client dashboard with trip stats, active/completed trip lists, and service selection.",
  "frontend/src/pages/CompanyWallet.tsx": "Displays company earnings, commissions, deposits, and completed trip metrics using data from Stripe and trip queries.",
  "frontend/src/pages/DriverDashboard.tsx": "Shows driver stats, trips, earnings, and allows viewing wallet or trip details with profile and status integration.",
  "frontend/src/pages/DriverWallet.tsx": "Calculates and displays driver earnings, deductions, and payouts grouped by payment status.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero content, login buttons, features, and an instructional video.",
  "frontend/src/utils/distance.ts": "Provides Haversine distance calculation and formatting utilities.",
  "frontend/src/utils/tripPricing.ts": "Calculates pricing, fees, and validity for manually entered trip mileage up to 10 miles.",
  "frontend/src/utils/tripProgress.ts": "Maps trip status and updates to progress steps, labels, and next driver actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL or hash parameters, persist them in sessionStorage, and clear them, supporting routing and sensitive token handling.",
  "frontend/tailwind.config.js": "Defines Tailwind CSS configuration with custom colors, shadows, typography, container settings, and animation extensions.",
  "project_state.json": "Stores the project’s versioned state, overall summary, and a list of implemented features with descriptions and metadata."
}