{
  "backend/main.mo": "Defines actor with comprehensive types for users, drivers, trips, payments, locations, and earnings, and initializes authorization and approval state with multiple mixins.",
  "backend/migration.mo": "Provides migration logic converting OldTrip records to NewTrip by defaulting null distance values to 0.0.",
  "feature_evidence.json": "Lists features, related files, components, test IDs, and metadata for recent product updates.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing UI components, workflows, styling, and booking logic.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point setting metadata, brand icons, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React component handling authentication, role selection, profile setup, approval checks, and routing to dashboards.",
  "frontend/src/components/ApprovalPendingScreen.tsx": "Displays a pending-approval message with driver-specific requirements and instructions using translated text and user profile data.",
  "frontend/src/components/BookingRequestForm.tsx": "Provides a booking request form with location capture, driver selection, pricing logic, and checkout session creation.",
  "frontend/src/components/Footer.tsx": "Renders a site footer with a scroll-to-top video button and branding information.",
  "frontend/src/components/Header.tsx": "Shows the main header with authentication handling, theme and language controls, and user role badges.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or updating customer or driver profiles, including photos, location capture, and approval requests.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal allowing users to choose between customer or driver roles before setup.",
  "frontend/src/components/ServiceSelectionForm.tsx": "Form for selecting a service, driver, locations, payment type, and creating a trip with distance and deposit calculations.",
  "frontend/src/components/StripeSetupCheck.tsx": "Admin-only dialog prompting initial Stripe configuration with secret key and allowed countries.",
  "frontend/src/components/TripDetailsDialog.tsx": "Dialog showing trip details and allowing drivers to update status, submit messages, and finalize trip completion info.",
  "frontend/src/components/VideoPlayer.tsx": "Custom video player with play, mute, fullscreen controls, overlays, and optional autoplay-muted behavior.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor tied to Internet Identity, invalidating queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for handling Internet Identity authentication, login flow, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, driver, trip, and earnings data via the actor API with cache invalidation.",
  "frontend/src/i18n/i18n.ts": "Handles language detection, storage, and translation resolution with fallback and interpolation.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context provider managing app language state and translation lookup.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and the full translation dictionary for the UI.",
  "frontend/src/i18n/useI18n.ts": "Exports a hook that returns the i18n context utilities.",
  "frontend/src/index.css": "Tailwind CSS base file defining light and dark theme variables and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin interface showing approvals, company earnings, and wallet access with actions for managing user approval statuses.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard displaying trip stats, active and completed trips, and service booking UI.",
  "frontend/src/pages/CompanyWallet.tsx": "Shows company revenue metrics using earnings and trip data with cards for totals and loading indicators.",
  "frontend/src/pages/DriverDashboard.tsx": "Displays driver stats, trip summaries, and navigation to the wallet with trip detail functionality.",
  "frontend/src/pages/DriverWallet.tsx": "Calculates and displays driver earnings, deductions, and payout status using completed trip data.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero content, login buttons, video section, and feature highlights.",
  "frontend/src/utils/distance.ts": "Provides Haversine distance calculation and formatted distance output.",
  "frontend/src/utils/tripProgress.ts": "Maps trip status and updates to progress steps, labels, and next driver actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them, supporting routing and token handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes project state, versioning, and a detailed list of existing features for an ICP-based service app."
}