{
  "backend/main.mo": "Defines backend actor types for users, drivers, trips, payments, media, and authorization, setting up core domain models and state initialization.",
  "feature_evidence.json": "Contains feature evidence reports mapping feature IDs to related files, components, and test IDs for workflow and trip progress features.",
  "frontend-file-summaries.txt": "Lists short human-written summaries of all frontend files, covering dashboards, hooks, components, styling, and configuration.",
  "frontend/index.css": "Defines global Tailwind CSS variables and themes for light/dark mode using OKLCH values and shared styling primitives.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, branding assets, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main app controller handling authentication, role selection, profile setup, and routing to dashboards based on user state and approvals.",
  "frontend/src/components/ApprovalPendingScreen.tsx": "Displays approval‑pending UI with instructions, driver requirements, and localized messaging based on user profile.",
  "frontend/src/components/BookingRequestForm.tsx": "Form for booking companion services, handling location, driver selection, pricing estimate, and checkout creation. Loads driver photos and validates required inputs before submitting.",
  "frontend/src/components/Footer.tsx": "Footer displaying a link to scroll to a video and copyright text with branding.",
  "frontend/src/components/Header.tsx": "Header with authentication, theme switching, language selection, and user role display. Shows user profile info and provides navigation controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or updating user or driver profiles, including location capture and photo uploads. Handles validation and submits profile data to backend hooks.",
  "frontend/src/components/RoleSelectionModal.tsx": "Modal allowing users to choose between customer or driver roles, highlighting selected role and continuing on confirmation.",
  "frontend/src/components/ServiceSelectionForm.tsx": "Form for selecting service types, drivers, locations, and payment method, with cost calculations and deposit checkout or trip creation. Loads drivers and supports optional translator needs.",
  "frontend/src/components/StripeSetupCheck.tsx": "Admin-only dialog prompting initial Stripe configuration with secret key and allowed countries, submitting via mutation.",
  "frontend/src/components/TripDetailsDialog.tsx": "Dialog showing trip details and enabling drivers to update status, send messages, and record completion info.",
  "frontend/src/components/VideoPlayer.tsx": "Custom video player component with play/pause, mute, fullscreen, and optional autoplay-muted behavior.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user, driver, trip, and profile data operations.",
  "frontend/src/i18n/i18n.ts": "Provides language detection, storage, and translation utilities with fallback to English and key interpolation support.",
  "frontend/src/i18n/I18nProvider.tsx": "I18n provider supplying current language, setter, and translation function backed by stored preference.",
  "frontend/src/i18n/translations.ts": "Defines supported languages and contains nested translation dictionaries for English, Spanish, and French.",
  "frontend/src/i18n/useI18n.ts": "Exports a hook that returns the i18n context for accessing translations.",
  "frontend/src/index.css": "Tailwind CSS base styles with custom light/dark theme variables for a gold-accented UI.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard showing approval queues, company earnings, stats, and navigation to the company wallet.",
  "frontend/src/pages/ClientDashboard.tsx": "Client dashboard displaying welcome info, trip stats, active/completed trips, and service booking options.",
  "frontend/src/pages/CompanyWallet.tsx": "Displays company revenue metrics, commissions, deposits, and syncing status using Stripe-integrated earnings data.",
  "frontend/src/pages/DriverDashboard.tsx": "Driver dashboard showing profile, trips, earnings, and wallet access, with trip filtering and progress handling.",
  "frontend/src/pages/DriverWallet.tsx": "Displays detailed driver earnings, payment status breakdowns, and trip-based payout calculations.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, login buttons, feature sections, and an instructional video.",
  "frontend/src/utils/tripProgress.ts": "Utility for mapping trip status to progress steps, next driver actions, and display labels.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence support.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom OKLCH color system, extended shadows, keyframes, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON storing project metadata, feature definitions, and versioned descriptions for authentication, roles, profiles, driver workflows, admin tools, and Stripe-related features."
}