{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 41,
  "summary": "Cityprop (\"Cityprop INC Multi-services\") is an Internet Computer (ICP) full-stack dApp that provides a multi-service, Uber-like marketplace with separate Customer and Driver experiences plus an Admin back office. Users authenticate with DFINITY Internet Identity, choose an application role (Customer or Driver), complete profile setup (including geolocation), and then interact with role-gated dashboards. Customers can browse approved drivers (with photos), select a service, create a Trip record (with pickup/dropoff addresses, optional GPS coordinates, translator request, notes, and manual miles for distance-based services), and pay a required deposit via Stripe Checkout. Drivers view assigned trips, update trip workflow states with messages (accepted → en route → arrived → in progress → completed), optionally record actual miles driven, and answer a post-trip “helped load items” prompt for shopping-related trips. Admins configure Stripe, manage user approval statuses (pending/approved/rejected), and view company earnings summaries (commission + deposits). The backend is written in Motoko and includes access control (admin/user/guest), a driver-approval subsystem, Stripe HTTPS outcalls, blob-storage utilities for driver photos, and earnings endpoints.",
  "architectural_notes": [
    "Frontend is React + TypeScript, using TanStack React Query for all backend calls (queries/mutations), cache invalidation, and 10-second polling for trips/earnings to provide near real-time updates.",
    "Authentication uses DFINITY Internet Identity (AuthClient) with long-lived delegations (30 days); identity is exposed via a React context provider and used to create authenticated canister actors.",
    "Backend is a Motoko canister with modular “mixin” composition (authorization, blob-storage), explicit role checks, and a separate approval subsystem gating driver capabilities and visibility.",
    "Authorization model is layered: system roles (#admin/#user/#guest) via AccessControl plus application roles (#customer/#driver) stored in UserProfile; most endpoints enforce both.",
    "Stripe integration is implemented via ICP HTTPS outcalls (ic:aaaaa-aa http_request) with a transform function that strips headers; Stripe configuration is stored on-canister and admin-managed via a frontend setup dialog.",
    "Driver media uses an ExternalBlob abstraction and a blob-storage gateway allowlist pulled from a “cashier” canister; frontend renders driver photos via getDirectURL().",
    "UI is built with shadcn-style components + Tailwind; theming uses OKLCH CSS variables and next-themes for light/dark/system mode.",
    "i18n is implemented via a custom I18nProvider with browser language detection (en/es/fr), localStorage persistence, and a header language selector.",
    "Repo includes a standalone build-template workspace (Dockerfile + icp.yaml/canister.yaml + deploy scripts + React/shadcn frontend template) to standardize builds/deployments and enable reuse across projects."
  ],
  "known_issues": [
    "Driver onboarding/approval deadlock: saveCallerUserProfile downgrades unapproved #driver profiles to #customer, while requestApproval requires isDriver(caller). Additionally, saveDriverProfile/uploadDriverPhoto require the caller to already be an approved driver. This prevents a new driver from completing the intended “create driver profile → request approval” path without admin intervention.",
    "Anonymous/guest calls can cause noisy errors: useGetCallerUserProfile runs whenever an actor exists (including anonymous actor) but backend getCallerUserProfile traps unless caller has #user; this can surface errors on the logged-out landing page/header.",
    "Stripe allowedCountries encoding bug: buildCheckoutSessionBody always uses index [0] for shipping_address_collection[allowed_countries], so multiple allowed countries are not encoded correctly.",
    "Stripe urlEncode is incomplete (only encodes space, &, =); other reserved characters are not encoded and may break requests (URLs, descriptions, etc.).",
    "Trip IDs are generated client-side using Date.now(); this is not collision-safe and is not guaranteed unique across users/devices or rapid submissions.",
    "No implemented linkage from Stripe success to trip payment fields: Trip.depositPaid/paymentStatus are created but there is no webhook/outcall-based reconciliation shown; successUrl does not include tripId for reliable correlation.",
    "DriverEarnings storage/update appears stubbed: updateDriverEarnings resets totals to 0 and overwrites paymentBreakdown with a single entry instead of aggregating across trips.",
    "Duplicate/global CSS definitions exist in both frontend/src/index.css and frontend/index.css; if both are included in builds, theme tokens may conflict.",
    "Critical deployment config dependency: backend authorization initialization traps if CAFFEINE_ADMIN_TOKEN env var is not set, breaking authenticated actor initialization.",
    "Potential env var typo risk in blob-storage: CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (triple “F”) must match deployment configuration exactly or storage gateway authorization updates will trap."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout, delegation persistence)",
      "synonyms": [
        "DFINITY Internet Identity",
        "AuthClient",
        "II login"
      ],
      "description": "Provides a React context for Internet Identity authentication using AuthClient, loads any stored identity on startup, supports login/logout, and exposes identity plus status flags to the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation with access-control bootstrap",
      "synonyms": [
        "useActor",
        "_initializeAccessControlWithSecret",
        "admin token bootstrap"
      ],
      "description": "Creates an authenticated or anonymous canister actor depending on whether an identity is available. On authenticated actor creation it calls _initializeAccessControlWithSecret using a secret token from the URL hash/session to register the caller (and optionally bootstrap the first admin).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role selection and first-time profile setup flow",
      "synonyms": [
        "RoleSelectionModal",
        "ProfileSetupModal",
        "AppRole onboarding"
      ],
      "description": "For first-time authenticated users without a saved profile, the app forces selection of an application role (Customer or Driver) and then collects required profile fields (name, phone, coordinates) before granting dashboard access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "User profile management (read/write + profile image)",
      "synonyms": [
        "getCallerUserProfile",
        "saveCallerUserProfile",
        "saveProfileImage"
      ],
      "description": "Backend stores per-principal UserProfile objects (name, phone, coordinates, app role) and supports reading/writing profiles and attaching an optional profile image blob with access checks (self or admin).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Driver profile management (car info, photo, Stripe account ID)",
      "synonyms": [
        "DriverProfile",
        "saveDriverProfile",
        "uploadDriverPhoto",
        "connect Stripe"
      ],
      "description": "Supports driver-specific profiles including car identifier, coordinates, optional photo (ExternalBlob) and optional Stripe connected account ID, with endpoints to connect/disconnect Stripe account IDs and upload driver photos (role/approval gated).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Driver approval workflow (request/review/gate)",
      "synonyms": [
        "isCallerApproved",
        "requestApproval",
        "listApprovals",
        "setApproval",
        "ApprovalPendingScreen"
      ],
      "description": "Implements a user approval state machine (pending/approved/rejected). Drivers can request approval, admins can list and set approvals, and unapproved users are gated from dashboards and shown an approval pending screen with email instructions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "System role-based access control (admin/user/guest)",
      "synonyms": [
        "AccessControl",
        "isCallerAdmin",
        "assignRole"
      ],
      "description": "Backend maintains system roles (#admin/#user/#guest) with an initialization routine (first valid token caller becomes admin) and admin-only role assignment and checks; frontend exposes isCallerAdmin for gating admin UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Driver directory for customers (approved drivers only)",
      "synonyms": [
        "getAllDrivers",
        "driver selection list"
      ],
      "description": "Customers can fetch a list of approved driver profiles for selection during booking; the frontend displays names, car numbers, and driver photos via blob direct URLs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Service catalog selection and booking form",
      "synonyms": [
        "ServiceSelectionForm",
        "service types",
        "translator needed"
      ],
      "description": "Implements a multi-step booking UI with a service catalog (hourly companion services and distance-based shopping/pickup services), driver selection, pickup/dropoff address entry, optional GPS coordinate capture, translator-needed flag, notes, cost breakdown, and submission validation (including max miles for distance-based services).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Trip pricing utilities (manual miles rules)",
      "synonyms": [
        "tripPricing",
        "distance-based pricing",
        "max 10 miles"
      ],
      "description": "Shared frontend utilities calculate and validate pricing for distance-based services using manually entered miles (e.g., <=10 miles → $10 deposit + $25 service fee) and expose helpers for max-distance and booking eligibility checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Distance calculation utility (Haversine)",
      "synonyms": [
        "calculateDistance",
        "formatDistance"
      ],
      "description": "Frontend utility computes great-circle distance in miles between two coordinate pairs and formats distance for display; used for estimating trip distance when coordinates are available.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Trip creation and persistence",
      "synonyms": [
        "createTrip",
        "Trip model"
      ],
      "description": "Customers can create and persist Trip records in the backend, including status, pricing breakdown, payment status, location details (addresses/coordinates), special requests, translator flag, help-loading flag, and optional miles field.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Trip retrieval and role-scoped trip lists",
      "synonyms": [
        "getTrip",
        "getClientTrips",
        "getDriverTrips"
      ],
      "description": "Backend supports fetching a single trip with access checks and listing trips for the logged-in client or driver (admin override). Frontend polls trip lists every 10 seconds for updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Trip workflow status updates with structured messages",
      "synonyms": [
        "updateTripStatus",
        "StatusUpdate",
        "trip progress steps"
      ],
      "description": "Drivers (and authorized parties) update trip status and attach structured StatusUpdate messages (accepted/enRoute/arrived/inProgress/completed/cancelled). Frontend maps statuses to an Uber-like progress UI and provides guided “next action” controls in a trip details dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Driver post-trip and trip-detail updates (help loading + miles)",
      "synonyms": [
        "updateHelpLoadingItems",
        "updateTripMiles"
      ],
      "description": "Allows the assigned driver (or admin) to record whether the driver offered help loading items and to store actual miles driven for a trip; surfaced in the TripDetails dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Trip payment status tracking (admin update)",
      "synonyms": [
        "PaymentStatus",
        "updateTripPaymentStatus"
      ],
      "description": "Trips include a PaymentStatus enum (pending/paid/transferred). Backend provides an admin-only method to update a trip’s payment status; frontend invalidates trips and earnings caches on changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Stripe configuration management (admin-only)",
      "synonyms": [
        "StripeSetupCheck",
        "setStripeConfiguration",
        "isStripeConfigured"
      ],
      "description": "Admin can store Stripe secret key and allowed countries in canister state. Frontend checks configuration and, if missing, prompts admins with a setup dialog to enable payments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Stripe Checkout session creation (general/deposit/final)",
      "synonyms": [
        "createCheckoutSession",
        "createDepositCheckoutSession",
        "createFinalPaymentCheckoutSession"
      ],
      "description": "Frontend creates Stripe Checkout sessions via backend APIs for different payment intents (general, deposit, final), parses the returned JSON into {id,url}, and redirects the user to Stripe-hosted checkout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Stripe session status lookup",
      "synonyms": [
        "getStripeSessionStatus"
      ],
      "description": "Backend queries Stripe for a checkout session’s status and extracts client_reference_id (principal text) for correlation/diagnostics.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Earnings and wallet dashboards with polling",
      "synonyms": [
        "DriverWallet",
        "CompanyWallet",
        "earnings summary"
      ],
      "description": "Driver and company wallet UIs compute and display earnings breakdowns, group completed trips by payout status, and show near real-time syncing using 10-second polling of trip/earnings/company earnings endpoints. Admin dashboard includes an earnings summary and navigation to Company Wallet.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Instructional video playback UI",
      "synonyms": [
        "VideoPlayer",
        "autoplay muted preview"
      ],
      "description": "Reusable video player component supports autoplay-muted previews, play/pause, mute/unmute, fullscreen, and custom overlay controls; embedded on landing and driver pages for onboarding videos.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Backend video metadata management",
      "synonyms": [
        "uploadVideoMetadata",
        "getVideosByType"
      ],
      "description": "Admin can upload video metadata records and users can query metadata lists and filter by video type (client instructional vs driver instructional), with role gating per type.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Internationalization (i18n) with language detection and selector",
      "synonyms": [
        "I18nProvider",
        "useI18n",
        "en/es/fr"
      ],
      "description": "Provides translation dictionaries (English/Spanish/French), detects browser language (including locale normalization), persists selection in localStorage, and exposes a header language selector.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Theming and responsive design system",
      "synonyms": [
        "Tailwind theme tokens",
        "OKLCH variables",
        "next-themes"
      ],
      "description": "Implements a black-and-gold themed UI with Tailwind + OKLCH CSS variables, custom gold shadows/animations, shadcn-style components, and light/dark/system theme toggle via next-themes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Secure URL hash secret utilities",
      "synonyms": [
        "urlParams",
        "caffeineAdminToken hash"
      ],
      "description": "Utilities to read sensitive parameters from the URL hash (not sent to servers), persist them in sessionStorage, and remove them from the address bar to reduce leakage risk; used for the admin bootstrap token.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Blob storage operational mixin (gateway allowlist, GC, cashier refill)",
      "synonyms": [
        "blob-storage",
        "storage gateway principals",
        "dead blob pruning"
      ],
      "description": "Backend includes a storage mixin to update authorized gateway principals from a cashier canister, list/prune dead blobs, trigger Motoko GC, and allow the cashier to top up cycles for storage operations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Production publish verification checklist documentation",
      "synonyms": [
        "ops checklist",
        "Draft v29 publish doc"
      ],
      "description": "Repository includes an operational checklist documenting steps to verify and promote a specific draft release to production, covering auth, role flows, dashboards, approval, Stripe, i18n, theming, and regression checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Centralized frontend backend-API hooks",
      "synonyms": [
        "useQueries",
        "React Query hooks"
      ],
      "description": "A comprehensive set of typed React Query hooks wraps backend calls for profiles, drivers, trips, approvals, Stripe, and earnings, including cache invalidation patterns and periodic polling for selected resources.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Reusable build-template scaffold (Docker + ICP deploy + React frontend template)",
      "synonyms": [
        "build-template",
        "icp.yaml",
        "deploy.sh",
        "template workspace"
      ],
      "description": "Repository now includes a reusable build-template workspace containing Dockerfile, ICP deploy configuration (icp.yaml/canister.yaml), standardized scripts (deploy, prune/resize images), and a React+TypeScript+shadcn/Tailwind frontend template with lint rules to bootstrap similar ICP dApps consistently.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-revise-the-customer-client-booking-entry-point-so-it-is-obvious-where-a-customer-should-tap-click-to-start-a-request-uber-like-flow-add-a-prominent-primary-action-on-the-clientdashboard-that-opens-the-booking-flow-immediately-with-clear-labeling-in-english-e-g-request-a-ride-service-where-are-you-going",
      "title": "Revise the Customer (Client) booking entry point so it is obvious where a customer should tap/click to start a request (Uber-like flow): add a prominent primary action on the ClientDashboard that opens the booking flow immediately, with clear labeling in English (e.g., “Request a Ride/Service” / “Where are you going?”).",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-booking-ui-is-fully-interactive-not-presented-as-a-static-picture-within-the-serviceselectionform-flow-the-customer-must-be-able-to-type-pickup-address-dropoff-address-notes-choose-a-service-select-a-driver-and-submit-the-request-using-standard-form-controls",
      "title": "Ensure the booking UI is fully interactive (not presented as a static 'picture'): within the ServiceSelectionForm flow, the customer must be able to type pickup address, dropoff address, notes, choose a service, select a driver, and submit the request using standard form controls.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-make-the-customer-to-driver-request-visibility-explicit-after-a-customer-submits-a-booking-trip-creation-provide-an-in-app-confirmation-and-ensure-the-new-trip-appears-in-the-customer-s-trip-list-and-can-be-opened-in-tripdetailsdialog-the-corresponding-driver-experience-must-show-the-new-trip-as-a-pending-request-on-the-driverdashboard-using-the-existing-trip-polling",
      "title": "Make the customer-to-driver request visibility explicit: after a customer submits a booking (trip creation), provide an in-app confirmation and ensure the new trip appears in the customer’s trip list and can be opened in TripDetailsDialog; the corresponding driver experience must show the new trip as a pending request on the DriverDashboard (using the existing trip polling).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-keep-gps-support-the-way-you-can-no-map-dependency-preserve-and-or-improve-the-existing-geolocation-capture-controls-pickup-dropoff-coordinate-capture-in-the-booking-flow-and-display-captured-coordinates-and-computed-distance-where-applicable-without-integrating-external-map-gps-services",
      "title": "Keep GPS support “the way you can” (no map dependency): preserve and/or improve the existing geolocation capture controls (pickup/dropoff coordinate capture) in the booking flow, and display captured coordinates and computed distance where applicable without integrating external map/GPS services.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-customer-booking-flow-so-a-customer-can-enter-and-submit-a-service-request-pickup-address-dropoff-address-notes-service-driver-and-then-pay-using-the-provided-payment-link-instead-of-being-automatically-redirected-to-stripe-checkout",
      "title": "Update the customer booking flow so a customer can enter and submit a service request (pickup address, dropoff address, notes, service, driver) and then pay using the provided payment link instead of being automatically redirected to Stripe Checkout.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-the-driver-experience-clearly-surfaces-new-customer-requests-as-pending-trips-and-provides-explicit-actions-to-accept-or-decline-each-request",
      "title": "Ensure the driver experience clearly surfaces new customer requests as pending trips and provides explicit actions to accept or decline each request.",
      "reqIds": [
        "REQ-6"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-frontend-driver-decline-action-to-call-the-updated-backend-declinetrip-api-with-the-provided-reason-and-ensure-all-affected-trip-lists-refresh-correctly-after-accept-decline",
      "title": "Update the frontend driver decline action to call the updated backend declineTrip API with the provided reason, and ensure all affected trip lists refresh correctly after accept/decline.",
      "reqIds": [
        "REQ-9"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Revise customer booking/request UI to be Uber-like and fully interactive (not appearing as a static 'picture'), with clear tap/click inputs so customers can submit trip details that drivers can view as a request.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Allow customers to submit an in-app trip/request and then pay using a provided payment link (e.g., Stripe Checkout URL), with the submitted request visible to drivers who can accept or decline it.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Update the backend trip-request workflow so pending trips assigned to a specific driver are visible to that driver and can be accepted or declined without trapping.",
      "reqIds": [
        "REQ-7"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Persist a driver-provided decline reason on the trip record when a driver declines a pending request, and expose it to clients via existing trip retrieval APIs.",
      "reqIds": [
        "REQ-8"
      ],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Cityprop",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}