{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 22,
  "summary": "Cityprop INC Multi-services is a full-stack Internet Computer (ICP) dApp for booking and providing “companion” and errands services. It includes Internet Identity authentication, role-based experiences (Customer/Driver/Admin), user/driver profile management with geolocation and photo uploads, an admin-managed driver approval workflow, trip tracking, and Stripe integration for deposits and card payments. The frontend is a React + Tailwind (black-and-gold theme) app using TanStack React Query for backend calls with periodic polling for near real-time trip/payment status and wallet/earnings views; the backend is a Motoko canister with access control, approval state, Stripe HTTP outcalls, and blob-storage gateway mixins.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "II login",
        "AuthClient integration"
      ],
      "description": "Provides login/logout via DFINITY Internet Identity using AuthClient, loads persisted delegations on app start, tracks login status flags, and exposes identity to the app via a React context provider.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation and access-control initialization",
      "synonyms": [
        "useActor",
        "admin secret bootstrap"
      ],
      "description": "Creates an authenticated or anonymous backend actor depending on identity. On actor creation, calls _initializeAccessControlWithSecret using a secret token pulled from URL hash/session (caffeineAdminToken) to bootstrap the first admin. React Query invalidation/refetch occurs when identity changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role selection and role-based routing",
      "synonyms": [
        "AppRole flow",
        "Customer/Driver selection"
      ],
      "description": "For authenticated users without a profile, forces a modal role selection (customer or driver) and then runs profile setup. Once a profile exists, routes to the appropriate dashboard (Client/Driver/Admin) and blocks access when not approved.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "User profile management (create/read/update)",
      "synonyms": [
        "saveCallerUserProfile",
        "getCallerUserProfile"
      ],
      "description": "Stores and retrieves user profiles containing name, phone, coordinates, and explicit AppRole. Frontend profile setup captures geolocation and required fields and saves via backend APIs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Driver profile management and photo upload",
      "synonyms": [
        "driver registration",
        "driver listing"
      ],
      "description": "Supports creating/saving driver profiles with car info, coordinates, optional Stripe account id, and photo blob. Drivers can upload a photo (ExternalBlob) and customers can view approved drivers via getAllDrivers; frontend renders photos via blob direct URLs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Driver approval workflow (request, review, pending screen)",
      "synonyms": [
        "KYC/verification",
        "admin approvals"
      ],
      "description": "Implements a user approval state machine (pending/approved/rejected). Drivers can request approval, admins can list and set approvals, and non-approved users are shown an approval pending screen with instructions (email cityprop01@gmail.com).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Admin dashboard for approvals and earnings",
      "synonyms": [
        "AdminDashboard",
        "approvals management"
      ],
      "description": "Admin UI to review pending approvals and approve/reject users, plus a company earnings summary and navigation to the full Company Wallet view. Includes Stripe configuration gating via StripeSetupCheck.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Stripe configuration management (admin-only)",
      "synonyms": [
        "StripeSetupCheck",
        "setStripeConfiguration"
      ],
      "description": "Admin can configure Stripe secret key and allowed countries in-canister. Frontend detects configuration status and shows a setup modal when missing.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Stripe checkout session creation (deposit/final/general)",
      "synonyms": [
        "createCheckoutSession",
        "Stripe payments"
      ],
      "description": "Backend can create Stripe Checkout Sessions via HTTPS outcalls; frontend provides hooks to create sessions for general purchases, deposits, and final payments, parsing the returned JSON into {id,url} and redirecting users to Stripe checkout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Stripe session status lookup",
      "synonyms": [
        "getStripeSessionStatus"
      ],
      "description": "Backend exposes getStripeSessionStatus to query Stripe for a session and extract client_reference_id (user principal) for correlation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Trip management and listing",
      "synonyms": [
        "createTrip",
        "getClientTrips",
        "getDriverTrips"
      ],
      "description": "Backend defines Trip/TripStatus models and supports creating trips (customer-only), reading a trip with access checks, and listing trips for clients and drivers with admin override.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Trip payment status tracking and updates",
      "synonyms": [
        "PaymentStatus",
        "updateTripPaymentStatus"
      ],
      "description": "Trips include a PaymentStatus enum (pending/paid/transferred). Authorized parties (client/driver/admin) can update a trip’s payment status; frontend invalidates trip and earnings queries after updates.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Wallet and earnings dashboards with polling",
      "synonyms": [
        "DriverWallet",
        "CompanyWallet",
        "earnings polling"
      ],
      "description": "Driver wallet UI computes earnings from completed trips and groups by payment status; company wallet shows commission/deposit totals from backend. Queries for trips/earnings/company earnings poll every 10 seconds for near real-time updates and display syncing indicators.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Instructional video UX and backend video metadata",
      "synonyms": [
        "VideoPlayer",
        "How it works videos"
      ],
      "description": "Reusable VideoPlayer supports autoplay-muted previews, play/pause, mute, fullscreen, and custom controls. Landing and Driver dashboards embed instructional videos. Backend supports admin upload and role-restricted retrieval of video metadata by type.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Responsive UI shell with theming and branding",
      "synonyms": [
        "Header/Footer",
        "Tailwind theme"
      ],
      "description": "App shell includes branded header with role badges, theme toggle (light/dark/system), login/logout controls, and footer. Tailwind configuration provides gold palette and shadows; CSS variables use OKLCH tokens for consistent black-and-gold styling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Secure URL secret parameter utilities",
      "synonyms": [
        "admin token via hash",
        "urlParams helpers"
      ],
      "description": "Utilities extract secret parameters from URL hash (not sent to servers), persist them in sessionStorage, and clear them from the URL to reduce leakage risk; used for caffeineAdminToken handling.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Internationalization (i18n) framework",
      "synonyms": [
        "I18nProvider",
        "translations"
      ],
      "description": "Frontend includes an i18n provider with translation dictionaries and hooks to render UI strings via localized keys, enabling future multi-language support.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-update-the-customer-booking-flow-ui-to-collect-both-pickup-and-dropoff-addresses-and-calculate-an-estimated-distance-miles-from-pickup-and-dropoff-coordinates-when-available-provide-a-clear-ui-action-to-capture-coordinates-for-both-pickup-and-dropoff-e-g-a-use-current-location-gps-button-for-each-address-and-show-the-calculated-miles-in-the-cost-breakdown",
      "title": "Update the customer booking flow UI to collect both pickup and dropoff addresses and calculate an estimated distance (miles) from pickup and dropoff coordinates when available. Provide a clear UI action to capture coordinates for both pickup and dropoff (e.g., a “Use current location” / GPS button for each address), and show the calculated miles in the cost breakdown.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-pricing-rules-for-distance-up-to-10-miles-charge-a-10-non-refundable-deposit-and-a-25-service-fee-total-35-for-eligible-bookings-and-apply-the-same-pricing-rule-to-the-shopping-booking-flow-shopping-services-if-the-calculated-distance-is-greater-than-10-miles-prevent-checkout-booking-submission-and-show-an-english-validation-message-stating-that-pricing-is-only-supported-up-to-10-miles-at-this-time",
      "title": "Implement pricing rules for distance up to 10 miles: charge a $10 non-refundable deposit and a $25 service fee (total $35) for eligible bookings, and apply the same pricing rule to the Shopping booking flow (Shopping services). If the calculated distance is greater than 10 miles, prevent checkout/booking submission and show an English validation message stating that pricing is only supported up to 10 miles at this time.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-make-the-non-refundable-deposit-policy-explicit-in-the-booking-ui-add-english-user-facing-copy-in-the-booking-cost-breakdown-and-or-confirmation-area-stating-that-the-10-deposit-is-non-refundable-even-if-the-customer-cancels-the-service",
      "title": "Make the non-refundable deposit policy explicit in the booking UI: add English user-facing copy in the booking cost breakdown and/or confirmation area stating that the $10 deposit is non-refundable even if the customer cancels the service.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-persist-the-computed-distance-and-pickup-dropoff-address-details-on-the-trip-record-created-for-these-bookings-ensuring-backend-trip-distance-float-and-trip-locationdetails-pickupaddress-dropoffaddress-and-coordinates-when-available-are-populated-consistently-from-the-booking-flow",
      "title": "Persist the computed distance and pickup/dropoff address details on the Trip record created for these bookings, ensuring backend Trip.distance (Float) and Trip.locationDetails (pickupAddress/dropoffAddress and coordinates when available) are populated consistently from the booking flow.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add pickup and drop-off address inputs for bookings and use them to calculate trip distance/mileage.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement pricing rule for trips up to 10 miles: $10 non-refundable deposit (kept even if canceled) + $25 service fee.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Apply the same up-to-10-miles pricing rule ($10 deposit + $25 service fee) to the Shopping service flow as well.",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend uses React + TanStack React Query; backend interactions are wrapped in custom hooks (useQueries.ts) with cache invalidation and polling (10s) for near real-time updates.",
    "Authentication is via DFINITY Internet Identity (AuthClient) with long-lived delegations (30 days). Identity changes recreate the backend actor and force refetch/invalidation of dependent queries.",
    "Backend is a Motoko actor organized with mixins (authorization, blob storage) and a migration hook (with migration = Migration.run).",
    "Authorization is split into a simple role system (#admin/#user/#guest) plus an application role enum (#customer/#driver). Admin bootstrap is controlled by a shared secret compared against an environment variable (CAFFEINE_ADMIN_TOKEN).",
    "Driver onboarding includes a separate approval subsystem (user-approval/approval.mo) that gates driver features and driver listing.",
    "Stripe integration is implemented via ICP HTTPS outcalls (ic:aaaaa-aa http_request) with a transform function that strips response headers; backend stores Stripe configuration in-canister and exposes “is configured” and “create checkout session” APIs.",
    "Blob storage integration uses a gateway principal allowlist retrieved from a cashier canister; driver photos are stored as ExternalBlob references and rendered via getDirectURL() in the frontend.",
    "UI uses a shadcn-like component set with Tailwind, OKLCH CSS variables for theme tokens, and next-themes for light/dark/system toggling.",
    "Dashboards are role-based: landing page when unauthenticated; mandatory role selection and profile setup when authenticated without a profile; approval-pending screen when not approved; separate customer/driver/admin dashboards thereafter.",
    "Repository includes a standardized React build-template scaffold (Dockerfile, deploy scripts, canister yamls, eslint rules, shadcn-style UI library, image resize/prune scripts) and an app-level i18n provider with translation resources."
  ],
  "known_issues": [
    "Driver onboarding logic conflict: backend saveCallerUserProfile downgrades any non-approved #driver profile to #customer, but requestApproval requires isDriver(caller) (based on stored profile). This prevents new drivers from successfully requesting approval unless an admin intervenes.",
    "Service booking flows in the UI (ServiceSelectionForm/BookingRequestForm) create Stripe checkout sessions and redirect, but do not create or persist a Trip in the backend (no createTrip call wired in these components), so trips/earnings may remain empty.",
    "Stripe checkout body builder bug: allowedCountries are appended as shipping_address_collection[allowed_countries][0] for every country (index never increments), likely resulting in only one country being recognized by Stripe.",
    "Stripe urlEncode implementation is incomplete (only replaces space, &, =); other reserved characters are not encoded, potentially breaking requests for some inputs/URLs.",
    "DriverEarnings update logic appears incomplete: updateDriverEarnings sets totals (jobs/hours/mileage/earnings) to 0 and replaces paymentBreakdown with a single entry, suggesting a stub rather than an aggregation.",
    "Company earnings calculations sum TripCostCalculation.deposit and companyCommission; comments in UI mention specific per-booking allocations (e.g., $5), but backend lacks explicit tracking of company share vs full deposit amount, risking mismatched reporting.",
    "Environment variable typo risk: blob storage cashier principal env var key is 'CAFFFEINE_STORAGE_CASHIER_PRINCIPAL' (triple 'F') in multiple places; if intended to be 'CAFFEINE...', deployment configuration may fail.",
    "Duplicate/conflicting CSS file content appears in provided listing (frontend/src/index.css and frontend/index.css). If both exist in repo, it may cause theme token conflicts depending on build tooling and imports.",
    "AccessControl.getUserRole traps if a principal is not registered; anonymous actor calls can trigger traps if any query path inadvertently requires #user permissions before initialization."
  ],
  "isFixRequest": false,
  "generatedImages": [],
  "gameProjectType": "none",
  "projectName": "Cityprop INC Multi-services",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}